 <span style="color:deeppink">
        <h1> pandas</h>

In [3]:
 from pandas import Series, DataFrame

In [4]:
 import pandas as pd

<span style="color:darkslategray">
       <h1> Introduction to pandas Data Structures</h>

<span style="color:deeppink">
        <h1> Series</h>

A Series is a one-dimensional array-like object containing an array of data  and an associated array of data labels, called its index. The simplest Series is formed from only an array of data:

In [29]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [30]:
 obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [31]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [32]:
type(obj)

pandas.core.series.Series

In [33]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [34]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [35]:
obj2['b']

7

In [36]:
obj2[['a','c','b']]

a   -5
c    3
b    7
dtype: int64

In [37]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [38]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [39]:
import numpy as np

In [40]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [41]:
'a' in obj2

True

In [42]:
'f' in obj2

False

Should you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [43]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [44]:
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

When only passing a dict, the index in the resulting Series will have the dictâ€™s keys in sorted order.

In [46]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
states

['California', 'Ohio', 'Oregon', 'Texas']

In [47]:
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64


<span style="black">
         The
<span style="color:violet"> 
        isnull
<span style=" color:black">
        and 
<span style="color:violet"> 
        notnull
<span style=" color:black">
        functions in pandas should be used to detect missing data:

In [48]:
 pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [49]:
 pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [50]:
 obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [51]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

<span style="black">
      Both the Series object itself and its index have a
<span style="color:violet"> 
      name  
<span style=" color:black">
      attribute, which integrates with other key areas of pandas functionality:

In [52]:
 obj4.name = 'population'

In [53]:
 obj4.index.name = 'state'

In [54]:
 obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A Seriesâ€™s index can be altered in place by assignment:

In [55]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

<span style="color:deeppink">
        <h1> DataFrame</h>

The DataFrame has both a row and column index; it can be thought of as a dict of Series

In [56]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],        'year': [2000, 2001, 2002, 2001, 2002],        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [57]:
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

If you specify a sequence of columns, the DataFrameâ€™s columns will be exactly what you pass:

In [58]:
 DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

As with Series, if you pass a column that isnâ€™t contained in data, it will appear with NA values in the result:

In [59]:
 frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [60]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:

In [61]:
 frame2[['state','pop']]

        state  pop
one      Ohio  1.5
two      Ohio  1.7
three    Ohio  3.6
four   Nevada  2.4
five   Nevada  2.9

In [62]:
 frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

<span style="black">
     Rows can also be retrieved by position or name by a couple of methods, such as the
<span style="color:violet"> 
     ix
<span style=" color:black">
     indexing field:

In [63]:
 frame2.ix['three']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment. For example, the empty 'debt' column could be assigned a scalar value or an array of values:

In [64]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [65]:
frame2['debt'] = np.arange(5)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

When assigning lists or arrays to a column, the valueâ€™s length must match the length of the DataFrame. If you assign a Series, it will be instead conformed exactly to the DataFrameâ€™s index, inserting missing values in any holes:

In [66]:
 val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [67]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

Assigning a column that doesnâ€™t exist will create a new column. The del keyword will delete columns as with a dict:

In [68]:
 frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [69]:
 del frame2['eastern']

In [98]:
 frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')